{"id":2056,"date":"2021-11-21T19:50:18","date_gmt":"2021-11-21T19:50:18","guid":{"rendered":"https:\/\/angelicthegame.com\/?p=2056"},"modified":"2021-11-21T19:51:35","modified_gmt":"2021-11-21T19:51:35","slug":"captains-log-entry-6-symphony-of-the-forsaken-part-2","status":"publish","type":"post","link":"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/","title":{"rendered":"Captain’s Log Entry #6 – Symphony of the Forsaken Part 2"},"content":{"rendered":"<p>[et_pb_section fb_built=&#8221;1&#8243; _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; background_color=&#8221;#000000&#8243; border_radii=&#8221;on|15px|15px|15px|15px&#8221; box_shadow_style=&#8221;preset1&#8243; box_shadow_blur=&#8221;80px&#8221; box_shadow_spread=&#8221;-53px&#8221; box_shadow_color=&#8221;rgba(255,255,255,0.17)&#8221; global_colors_info=&#8221;{}&#8221; theme_builder_area=&#8221;post_content&#8221;][et_pb_row _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; global_colors_info=&#8221;{}&#8221; theme_builder_area=&#8221;post_content&#8221;][et_pb_column type=&#8221;4_4&#8243; _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; global_colors_info=&#8221;{}&#8221; theme_builder_area=&#8221;post_content&#8221;][et_pb_post_title meta=&#8221;off&#8221; featured_image=&#8221;off&#8221; _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; title_font=&#8221;Nunito|700|||||||&#8221; title_text_color=&#8221;#FFFFFF&#8221; title_font_size=&#8221;32px&#8221; global_colors_info=&#8221;{}&#8221; theme_builder_area=&#8221;post_content&#8221;][\/et_pb_post_title][et_pb_text _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; text_text_color=&#8221;#FFFFFF&#8221; text_font_size=&#8221;16px&#8221; global_colors_info=&#8221;{}&#8221; theme_builder_area=&#8221;post_content&#8221;]<\/p>\n<p><i><span>We found a way. A way to reach infinity. A way to ultimate redemption.<\/span><\/i><\/p>\n<p class=\"\"><i><span>A new… humanity!<\/span><\/i><\/p>\n<p class=\"\"><i><span>Ladies and gentlemen, we are proud to finally reveal the grandest technological advancement of our race’s history!<\/span><\/i><\/p>\n<p class=\"\"><i><span> Hail the first angel: Iset the Transcendent One!<\/span><\/i><\/p>\n<p><i><span>* A hologram of Iset appears on the scene. Thousands of drones competing to get a better angle to livestream the transcendent one’s appearance now. *<\/span><\/i><\/p>\n<p class=\"\"><i><span>Iset, please come here darling. Here… The entire world is now watching you. Would you like to say something?<\/span><\/i><\/p>\n<p><i><span>*Iset takes a step forward. Looks around for a second. With a stern look and confident attitude, she starts to float elegantly, and speaks; *<\/span><\/i><\/p>\n<p class=\"\"><i><span>“Behold, old ones… I have arrived.”<\/span><\/i><\/p>\n<p class=\"\"><strong><i>­<\/i>– From the announcement event of the Project Transcendence by Angelicon in 2507.<\/strong><\/p>\n<p>[\/et_pb_text][et_pb_image src=&#8221;https:\/\/angelicthegame.com\/wp-content\/uploads\/2021\/11\/Iset-the-Mother_Concept-Art_Angelic-843&#215;1024-1.jpg&#8221; title_text=&#8221;Iset-the-Mother_Concept-Art_Angelic-843&#215;1024&#8243; _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; hover_enabled=&#8221;0&#8243; global_colors_info=&#8221;{}&#8221; theme_builder_area=&#8221;post_content&#8221; align=&#8221;center&#8221; sticky_enabled=&#8221;0&#8243;][\/et_pb_image][et_pb_text _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; text_text_color=&#8221;#FFFFFF&#8221; text_font_size=&#8221;12px&#8221; text_line_height=&#8221;1.2em&#8221; global_colors_info=&#8221;{}&#8221; theme_builder_area=&#8221;post_content&#8221;]<\/p>\n<p class=\"\" style=\"text-align: center;\"><em>– Concept art of Iset, also known as Isis. Iset is often called by Iset the Transcendent One by humans. Neo-humans, however, call her as Iset the Mother. –<\/p>\n<p><\/em>[\/et_pb_text][et_pb_text _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; text_text_color=&#8221;#FFFFFF&#8221; text_font_size=&#8221;16px&#8221; header_2_text_color=&#8221;#FFFFFF&#8221; global_colors_info=&#8221;{}&#8221; theme_builder_area=&#8221;post_content&#8221;]<\/p>\n<h2><b>Hope is a Dangerous Thing<\/b><\/h2>\n<p class=\"\"><span>Project Transcendence was a declaration of open war against all of the corporations. This world’s system is based on a “professional slavery,” and even the possibility of elevating random people towards the top of the pyramid, with unseen talents, amazing intellectual capabilities and potentially immortal bodies was a cardinal sin in the eyes of the mega corporations.<\/span><\/p>\n<p class=\"\"><span>Only 24 hours after the project’s announcement, The Supreme Cartel, a union of the mega corporations which practically acted as a form of global government, gave a warning to Angelicon. However, it was an expected reaction, and Angelicon had no desire to fight against the big guys. At least, not yet.<\/span><\/p>\n<p class=\"\"><span>They played smart. With tons of political maneuvers and some compromises, The Supreme Cartel gave the greenlight for the project. However, the decision of who was going to transcend into a neo-human is now in the hands of the cartel executives and the project quickly became the elite’s path to immortality.<\/span><\/p>\n<p class=\"\"><span>While explaining the reason why they decided to limit the program’s reach, The Supreme Arbiter of the cartel summarized that <\/span><i><span>“…hope is a dangerous thing. Give too less to the masses, they become unstable. Give too much, they become dangerous. And you are giving it way too much, gentleman.<\/span><\/i><span>”<\/span><\/p>\n<h2><b>They are the Forsaken Ones!<\/b><\/h2>\n<p class=\"\"><span>Within less than a year, complications began to arise. Neo-humans, also known as “the angels”, started to show signs of serious psychological problems. More and more of them wanted to go back to their human forms over time, which was impossible. When some high-profile neo-humans committed suicide or completely lost it and started to act wildly, the Supreme Cartel decided to pause the program and authorized seven inspectors to investigate what was going on.<\/span><\/p>\n<p class=\"\"><span>They found that the safest way of transcending into a neo-human had an extremely high personal cost: One must accept to erase his or her memories; at least, most of them. The rich did not want to lose their path to immortality, so they accepted the solution offered by Angelicon executives and their scientists: an expansion of the program.<\/span><\/p>\n<p class=\"\"><span>Years later, the Supreme Cartel would realize that it was a trap. Initially, though, it was perceived as a great solution to save the program. It was simply about opening the program to the masses. To “the forsaken ones”, as one global media company famously described. The real intention was to use people as test subjects, until a proper fix was found for the dreadful psychological side effects of the transcendence.<\/span><\/p>\n<p class=\"\"><span>The hidden reason; however, was something else. Angelicon knew from the beginning that to properly transcend, the candidate’s memories must be almost entirely wiped out. From day one, they also knew there was no fix. The entire promise of the expansion program was a lie. They were not after a way to find a transfer of a human being into an angel with his or her full memories. They were after a revolution.<\/span><\/p>\n<h2><b>Interhuman Wars<\/b><\/h2>\n<p class=\"\"><span>Thousands of people volunteered, they had nothing to lose. Almost an immortal body, infinite life and god like powers were promised. It was a good deal. In fact, it was a “too good to be true” kind of a deal.<\/span><\/p>\n<p class=\"\"><span>Years have passed without any notable development on the fix; but something else was attracting attention: Neo-humans’ amazing capabilities and speed at developing technologies. They have encyclopedic memories and superb intellectual skills. They never tire, do not require to sleep, or eat, do not have any kind of emotional instability issues. They have an amazing efficiency. While Angelicon’s share value was skyrocketing, all the big corporations found themselves competing to grab more technologies and privileges from the creators of the angels. Within a decade, neo-humans silently grabbed most of the strategic positions within the corporations and replaced a lot of the workforce.<\/span><\/p>\n<p class=\"\"><span>For the ordinary people, Angelicon became the ultimate enemy. Neo-humans were threatening their jobs and future. Yet a lot of people were still trying to transcend, because they knew there was no feasible way to stop that revolution. A lot of people were planning to destroy the company, on the other hand. However, Angelicon has an impenetrable shield. It was a very unexpected ally’s protection: The Supreme Cartel’s member corporations.<\/span><\/p>\n<p class=\"\"><span>Why? Because now they all depend on Angelicon’s technology. They both envy them and admire them. They all know the potential danger yet cannot unify and try to digest Angelicon because they did not trust each other. At least Angelicon had no direct military division or army. They were no threat.<\/span><\/p>\n<p class=\"\"><span>That assumption proved to be the greatest mistake humankind ever made.<\/span><\/p>\n<p>[\/et_pb_text][et_pb_image src=&#8221;https:\/\/angelicthegame.com\/wp-content\/uploads\/2021\/11\/Daeva_Concept-Art_Angelic-690&#215;1024-1.jpg&#8221; title_text=&#8221;Daeva_Concept-Art_Angelic-690&#215;1024&#8243; _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; hover_enabled=&#8221;0&#8243; global_colors_info=&#8221;{}&#8221; theme_builder_area=&#8221;post_content&#8221; sticky_enabled=&#8221;0&#8243; align=&#8221;center&#8221;][\/et_pb_image][et_pb_text _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; text_text_color=&#8221;#FFFFFF&#8221; text_font_size=&#8221;12px&#8221; text_line_height=&#8221;1.2em&#8221; hover_enabled=&#8221;0&#8243; global_colors_info=&#8221;{}&#8221; theme_builder_area=&#8221;post_content&#8221; sticky_enabled=&#8221;0&#8243;]<\/p>\n<p class=\"\" style=\"text-align: center;\"><em>– Concept art of Daeva. Daeva was the first rebel and rallied thousands of neo-humans against the Cartel. Practically she ignited the interhuman war with her rebellion. However history records show Iset’s refusal of helping corporations against the rebel angels as the real beginning of the great war. –<\/em><\/p>\n<p>&nbsp;[\/et_pb_text][et_pb_text _builder_version=&#8221;4.13.1&#8243; _module_preset=&#8221;default&#8221; text_text_color=&#8221;#FFFFFF&#8221; text_font_size=&#8221;16px&#8221; header_2_text_color=&#8221;#FFFFFF&#8221; hover_enabled=&#8221;0&#8243; global_colors_info=&#8221;{}&#8221; theme_builder_area=&#8221;post_content&#8221; link_text_color=&#8221;#FFFFFF&#8221; link_font=&#8221;|800|||on||||&#8221; sticky_enabled=&#8221;0&#8243;]<\/p>\n<p class=\"\"><span>In 2522, the first rebel neo-human reported. She refused to continue working for Hoshi Ryū, a giant corporation headquartered in former Japan. Dozens of neo-humans followed her rebellion and wanted to break free from the chains of corporations. All have been eliminated brutally.<\/span><\/p>\n<p class=\"\"><span>Rebellions spread, however, in the following months. Celtic Triquetra, Lilac Crocus, Red Syndicate and Asteria were among the heavily affected mega corporations. Despite the global media’s efforts, neo-humans managed to leak tons of information about the corporation’s shady dealings and unfair treatments to their employees, human and neo-human alike. A global revolt began.<\/span><\/p>\n<p class=\"\"><span>In 2524 The Supreme Cartel declared neo-humans “illegal”, effectively marking them for mass execution. Angelicon strongly protested that decision, and as a result their membership status was stalled by the Cartel.<\/span><\/p>\n<p class=\"\"><span>Many people believed that Angelicon was secretly helping the rebel angels, and in 2526 the Cartel decided to cancel the trade license of the company, which practically means war against it. However, it quickly became clear that even Angelicon has lost their control over neo-humans.<\/span><\/p>\n<p class=\"\"><strong>The question was, who was leading them then?<\/strong><\/p>\n<p class=\"\"><span>Daeva, a secret neo-human prototype, who was engineered by Iset herself without the knowledge of the Cartel, but with the blessing of Angelicon top executives, revealed herself in 2527 before she blew up the Celtic Triquetra’s multi-million bitcoin worth space station.<\/span><\/p>\n<p class=\"\"><span>It was the grandest space station of humankind. It was the day when the interhuman war began globally. Yet not the entire neo-human population was actively fighting against the corporations. Hundreds of millions of humans were also rioting against the companies, as well. So the Cartel was not up against the rebel angels only. They were also busy with restless “forsaken ones”.<\/span><\/p>\n<p class=\"\"><span>War escalated quickly. Rebel angels kept hacking corporations’ data and they managed to create a global chaos. In 7<\/span><span>th<\/span><span> of July 2527, Iset, the very first neo-human ever created, decided to join the rebellion by refusing the help request coming from Angelicon company itself. Her decision marked the official beginning of the interhuman war; because millions of neo-humans also joined the rebellion afterwards and days later all the corporations united against them.<\/span><\/p>\n<p class=\"\"><span>Now called as the “fallen angels”, neo-humans shifted their strategies and instead of playing defensive with some guerrilla tactics, under Iset’s leadership, they started to act offensively. Within weeks the Cartel found itself defending its own bases and assets. The second wave led by Iset proved to be a massive force with unforeseen technologies and new “arch-angels”. Apart from Daeva, who was revealed herself before, they realized that Iset has created a lot of super advanced neo-humans.<\/span><\/p>\n<p class=\"\"><span>Atum the Mysterious led the offensive against Lilac Crocus. Kayra and Andraste (the Chaos twins) were fighting against Angelicon. Sigrun and Siegfried AKA Valkyries, along with Eir the Merciful, Minerva the Owl, and Lywen the Red (Crimson Angels) united against Asteria and Red Syndicate. Badb, Macha and Annand, collectively called the Phantom Crows, were giving hell to Hoshi Ryū. They have three things in common. They were listening to Iset, they were all using mythological and historical names, and they came out of nowhere.<\/span><\/p>\n<p class=\"\"><span>In 2528, within seven months, fallen angels literally devastated the corporations. The Supreme Cartel asked for unconditional surrender. For days, they did not receive any reply. It was the day the world stood still.<\/span><\/p>\n<p class=\"\"><span>Then, mysteriously, angels started to retreat. Nobody understood what was happening. In two weeks they all gone.<\/span><\/p>\n<p class=\"\"><span>The abrupt end of the interhuman war was a turning point for humanity. What happened after the war? How has human society evolved? What was the fate of the Cartel and mega corporations? Why did the neo-humans decide to retreat and what happened to them?<\/span><\/p>\n<p class=\"\"><span>We will discuss these topics later.<\/span><\/p>\n<p class=\"\"><span>I hope you enjoyed the backstory so far. I will leave the narrative side of the game for a while and concentrate on different topics in upcoming weeks. Please let us know what you think about the story by sending your comments below. You can also join our <a href=\"https:\/\/discord.gg\/qvQnCyX\" target=\"_blank\" rel=\"noopener noreferrer\">Discord<\/a> server and be a part of our great community, get faster and more frequent updates from the game’s development!<\/span><\/p>\n<p class=\"\"><span>See you next week.<\/span><\/p>\n<p class=\"\"><span>Erkan Bayol<\/span><\/p>\n<p>[\/et_pb_text][\/et_pb_column][\/et_pb_row][\/et_pb_section]<\/p>\n","protected":false},"excerpt":{"rendered":"<p>We found a way. A way to reach infinity. A way to ultimate redemption. A new… humanity! Ladies and gentlemen, we are proud to finally reveal the grandest technological advancement of our race’s history!  Hail the first angel: Iset the Transcendent One! * A hologram of Iset appears on the scene. Thousands of drones competing [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_et_pb_use_builder":"on","_et_pb_old_content":"","_et_gb_content_width":"1080"},"categories":[7],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v18.2 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Captain’s Log Entry #6 – Symphony of the Forsaken Part 2 - Angelic the Game<\/title>\n<meta name=\"description\" content=\"We found a way. A way to reach infinity. A way to ultimate redemption. A new… humanity!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Captain’s Log Entry #6 – Symphony of the Forsaken Part 2 - Angelic the Game\" \/>\n<meta property=\"og:description\" content=\"We found a way. A way to reach infinity. A way to ultimate redemption. A new… humanity!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/\" \/>\n<meta property=\"og:site_name\" content=\"Angelic the Game\" \/>\n<meta property=\"article:published_time\" content=\"2021-11-21T19:50:18+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-11-21T19:51:35+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/angelicthegame.com\/wp-content\/uploads\/2021\/11\/Iset-the-Mother_Concept-Art_Angelic-843x1024-1.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"843\" \/>\n\t<meta property=\"og:image:height\" content=\"1024\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"metaversegamestudios\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Organization\",\"@id\":\"https:\/\/angelicthegame.com\/#organization\",\"name\":\"Angelic the Game\",\"url\":\"https:\/\/angelicthegame.com\/\",\"sameAs\":[],\"logo\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/angelicthegame.com\/#logo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/angelicthegame.com\/wp-content\/uploads\/2022\/01\/Angelic-Logo-Cropped-Small.png\",\"contentUrl\":\"https:\/\/angelicthegame.com\/wp-content\/uploads\/2022\/01\/Angelic-Logo-Cropped-Small.png\",\"width\":700,\"height\":48,\"caption\":\"Angelic the Game\"},\"image\":{\"@id\":\"https:\/\/angelicthegame.com\/#logo\"}},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/angelicthegame.com\/#website\",\"url\":\"https:\/\/angelicthegame.com\/\",\"name\":\"Angelic the Game\",\"description\":\"Narrative Turn-Based Sci-Fi RPG\",\"publisher\":{\"@id\":\"https:\/\/angelicthegame.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/angelicthegame.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/#webpage\",\"url\":\"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/\",\"name\":\"Captain’s Log Entry #6 – Symphony of the Forsaken Part 2 - Angelic the Game\",\"isPartOf\":{\"@id\":\"https:\/\/angelicthegame.com\/#website\"},\"datePublished\":\"2021-11-21T19:50:18+00:00\",\"dateModified\":\"2021-11-21T19:51:35+00:00\",\"description\":\"We found a way. A way to reach infinity. A way to ultimate redemption. A new… humanity!\",\"breadcrumb\":{\"@id\":\"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/angelicthegame.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Captain’s Log Entry #6 – Symphony of the Forsaken Part 2\"}]},{\"@type\":\"Article\",\"@id\":\"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/#webpage\"},\"author\":{\"@id\":\"https:\/\/angelicthegame.com\/#\/schema\/person\/6f967617c235385825a3f241d6b08bfc\"},\"headline\":\"Captain’s Log Entry #6 – Symphony of the Forsaken Part 2\",\"datePublished\":\"2021-11-21T19:50:18+00:00\",\"dateModified\":\"2021-11-21T19:51:35+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/#webpage\"},\"wordCount\":2058,\"publisher\":{\"@id\":\"https:\/\/angelicthegame.com\/#organization\"},\"articleSection\":[\"Captains Log\"],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/angelicthegame.com\/#\/schema\/person\/6f967617c235385825a3f241d6b08bfc\",\"name\":\"metaversegamestudios\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/angelicthegame.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/67440ce7e46fcfb3225cc5affa61b101?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/67440ce7e46fcfb3225cc5affa61b101?s=96&d=mm&r=g\",\"caption\":\"metaversegamestudios\"},\"sameAs\":[\"https:\/\/angelicthegame.com\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Captain’s Log Entry #6 – Symphony of the Forsaken Part 2 - Angelic the Game","description":"We found a way. A way to reach infinity. A way to ultimate redemption. A new… humanity!","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/","og_locale":"en_US","og_type":"article","og_title":"Captain’s Log Entry #6 – Symphony of the Forsaken Part 2 - Angelic the Game","og_description":"We found a way. A way to reach infinity. A way to ultimate redemption. A new… humanity!","og_url":"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/","og_site_name":"Angelic the Game","article_published_time":"2021-11-21T19:50:18+00:00","article_modified_time":"2021-11-21T19:51:35+00:00","og_image":[{"width":843,"height":1024,"url":"https:\/\/angelicthegame.com\/wp-content\/uploads\/2021\/11\/Iset-the-Mother_Concept-Art_Angelic-843x1024-1.jpg","type":"image\/jpeg"}],"twitter_card":"summary_large_image","twitter_misc":{"Written by":"metaversegamestudios"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Organization","@id":"https:\/\/angelicthegame.com\/#organization","name":"Angelic the Game","url":"https:\/\/angelicthegame.com\/","sameAs":[],"logo":{"@type":"ImageObject","@id":"https:\/\/angelicthegame.com\/#logo","inLanguage":"en-US","url":"https:\/\/angelicthegame.com\/wp-content\/uploads\/2022\/01\/Angelic-Logo-Cropped-Small.png","contentUrl":"https:\/\/angelicthegame.com\/wp-content\/uploads\/2022\/01\/Angelic-Logo-Cropped-Small.png","width":700,"height":48,"caption":"Angelic the Game"},"image":{"@id":"https:\/\/angelicthegame.com\/#logo"}},{"@type":"WebSite","@id":"https:\/\/angelicthegame.com\/#website","url":"https:\/\/angelicthegame.com\/","name":"Angelic the Game","description":"Narrative Turn-Based Sci-Fi RPG","publisher":{"@id":"https:\/\/angelicthegame.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/angelicthegame.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/#webpage","url":"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/","name":"Captain’s Log Entry #6 – Symphony of the Forsaken Part 2 - Angelic the Game","isPartOf":{"@id":"https:\/\/angelicthegame.com\/#website"},"datePublished":"2021-11-21T19:50:18+00:00","dateModified":"2021-11-21T19:51:35+00:00","description":"We found a way. A way to reach infinity. A way to ultimate redemption. A new… humanity!","breadcrumb":{"@id":"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/angelicthegame.com\/"},{"@type":"ListItem","position":2,"name":"Captain’s Log Entry #6 – Symphony of the Forsaken Part 2"}]},{"@type":"Article","@id":"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/#article","isPartOf":{"@id":"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/#webpage"},"author":{"@id":"https:\/\/angelicthegame.com\/#\/schema\/person\/6f967617c235385825a3f241d6b08bfc"},"headline":"Captain’s Log Entry #6 – Symphony of the Forsaken Part 2","datePublished":"2021-11-21T19:50:18+00:00","dateModified":"2021-11-21T19:51:35+00:00","mainEntityOfPage":{"@id":"https:\/\/angelicthegame.com\/captains-log-entry-6-symphony-of-the-forsaken-part-2\/#webpage"},"wordCount":2058,"publisher":{"@id":"https:\/\/angelicthegame.com\/#organization"},"articleSection":["Captains Log"],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/angelicthegame.com\/#\/schema\/person\/6f967617c235385825a3f241d6b08bfc","name":"metaversegamestudios","image":{"@type":"ImageObject","@id":"https:\/\/angelicthegame.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/67440ce7e46fcfb3225cc5affa61b101?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/67440ce7e46fcfb3225cc5affa61b101?s=96&d=mm&r=g","caption":"metaversegamestudios"},"sameAs":["https:\/\/angelicthegame.com"]}]}},"_links":{"self":[{"href":"https:\/\/angelicthegame.com\/wp-json\/wp\/v2\/posts\/2056"}],"collection":[{"href":"https:\/\/angelicthegame.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/angelicthegame.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/angelicthegame.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/angelicthegame.com\/wp-json\/wp\/v2\/comments?post=2056"}],"version-history":[{"count":3,"href":"https:\/\/angelicthegame.com\/wp-json\/wp\/v2\/posts\/2056\/revisions"}],"predecessor-version":[{"id":2061,"href":"https:\/\/angelicthegame.com\/wp-json\/wp\/v2\/posts\/2056\/revisions\/2061"}],"wp:attachment":[{"href":"https:\/\/angelicthegame.com\/wp-json\/wp\/v2\/media?parent=2056"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/angelicthegame.com\/wp-json\/wp\/v2\/categories?post=2056"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/angelicthegame.com\/wp-json\/wp\/v2\/tags?post=2056"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}